[Survived] ObjectLiteral
hands-on/vuejs/src/App.vue:26:15
 import Navbar from "@/components/Navbar";
 import Footer from "@/components/Footer";
 export default {
-  components: {Footer, Navbar}
-}
-</script>
-
+  components: {}
