[Survived] ObjectLiteral
vuejs/src/api/weather.api.js:1:16
-export default {
-  getCityNextWeekWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
-      .then(response => response.json())
-      .then(response => response.dataseries)
-  },
-  getCityDetailedWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civil&output=json`)
-      .then(response => response.json())
-      .then(response => response.dataseries)
-  },
-  getCityTodayWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
-      .then(response => response.json())
-      .then(response => response.dataseries)
-      .then(dataseries => dataseries[0])
-  }
-}
+export default {}
 

[Survived] BlockStatement
vuejs/src/api/weather.api.js:2:37
 export default {
-  getCityNextWeekWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
-      .then(response => response.json())
-      .then(response => response.dataseries)
-  },
+  getCityNextWeekWeather(long, lat) {},
   getCityDetailedWeather(long, lat) {
     return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civil&output=json`)

[Survived] StringLiteral
vuejs/src/api/weather.api.js:3:18
 export default {
   getCityNextWeekWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
+    return fetch(``)
       .then(response => response.json())
       .then(response => response.dataseries)

[Survived] ArrowFunction
vuejs/src/api/weather.api.js:4:13
 export default {
   getCityNextWeekWeather(long, lat) {
     return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
-      .then(response => response.json())
+      .then(() => undefined)
       .then(response => response.dataseries)
   },

[Survived] ArrowFunction
vuejs/src/api/weather.api.js:5:13
   getCityNextWeekWeather(long, lat) {
     return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
       .then(response => response.json())
-      .then(response => response.dataseries)
+      .then(() => undefined)
   },
   getCityDetailedWeather(long, lat) {

[Survived] BlockStatement
vuejs/src/api/weather.api.js:7:37
       .then(response => response.json())
       .then(response => response.dataseries)
   },
-  getCityDetailedWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civil&output=json`)
-      .then(response => response.json())
-      .then(response => response.dataseries)
-  },
+  getCityDetailedWeather(long, lat) {},
   getCityTodayWeather(long, lat) {
     return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)

[Survived] ArrowFunction
vuejs/src/api/weather.api.js:9:13
   },
   getCityDetailedWeather(long, lat) {
     return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civil&output=json`)
-      .then(response => response.json())
+      .then(() => undefined)
       .then(response => response.dataseries)
   },

[Survived] BlockStatement
vuejs/src/api/weather.api.js:12:34
       .then(response => response.json())
       .then(response => response.dataseries)
   },
-  getCityTodayWeather(long, lat) {
-    return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
-      .then(response => response.json())
-      .then(response => response.dataseries)
-      .then(dataseries => dataseries[0])
-  }
+  getCityTodayWeather(long, lat) {}
 }
 

[Survived] ArrowFunction
vuejs/src/api/weather.api.js:16:13
     return fetch(`http://www.7timer.info/bin/api.pl?lon=${long}&lat=${lat}&product=civillight&output=json`)
       .then(response => response.json())
       .then(response => response.dataseries)
-      .then(dataseries => dataseries[0])
+      .then(() => undefined)
   }
 }
