[Survived] ArrayDeclaration
vuejs/src/components/LMap.vue:9:10
 
 export default {
   name: "LMap",
-  props: ['zoom', 'lat', 'long'],
-  data() {
-    return {
-      map: null,
+  props: []
       zoomLevel: 13
     }

[Survived] StringLiteral
vuejs/src/components/LMap.vue:9:11
 
 export default {
   name: "LMap",
-  props: ['zoom', 'lat', 'long'],
+  props: ["", 'lat', 'long'],
   data() {
     return {

[Survived] BlockStatement
vuejs/src/components/LMap.vue:10:10
 export default {
   name: "LMap",
   props: ['zoom', 'lat', 'long'],
-  data() {
-    return {
-      map: null,
-      zoomLevel: 13
-    }
-  },
-  mounted() {
-    this.map = L.map('mapId').setView([this.lat, this.long], this.zoomLevel)
-    L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
+  data() {} L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
       attribution: 'Map data &copy; <a href="https://www.openstreetmap.org/">OpenStreetMap</a> contributors',
       maxZoom: 18,

[Survived] ObjectLiteral
vuejs/src/components/LMap.vue:11:12
   name: "LMap",
   props: ['zoom', 'lat', 'long'],
   data() {
-    return {
-      map: null,
-      zoomLevel: 13
-    }
-  },
-  mounted() {
-    this.map = L.map('mapId').setView([this.lat, this.long], this.zoomLevel)
+    return {}his.map = L.map('mapId').setView([this.lat, this.long], this.zoomLevel)
     L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
       attribution: 'Map data &copy; <a href="https://www.openstreetmap.org/">OpenStreetMap</a> contributors',

[Survived] BlockStatement
vuejs/src/components/LMap.vue:16:13
       zoomLevel: 13
     }
   },
-  mounted() {
-    this.map = L.map('mapId').setView([this.lat, this.long], this.zoomLevel)
-    L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
-      attribution: 'Map data &copy; <a href="https://www.openstreetmap.org/">OpenStreetMap</a> contributors',
-      maxZoom: 18,
-      tileSize: 512,
-      zoomOffset: -1,
-    }).addTo(this.map);
-    L.marker([this.lat, this.long]).addTo(this.map)
-  }
-}
-</script>
-<style scoped>
+  mounted() {}yle scoped>
 #mapId {
   height: 350px;

[Survived] StringLiteral
vuejs/src/components/LMap.vue:17:22
     }
   },
   mounted() {
-    this.map = L.map('mapId').setView([this.lat, this.long], this.zoomLevel)
+    this.map = L.map("").setView([this.lat, this.long], this.zoomLevel)
     L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
       attribution: 'Map data &copy; <a href="https://www.openstreetmap.org/">OpenStreetMap</a> contributors',

[Survived] UnaryOperator
vuejs/src/components/LMap.vue:22:19
       attribution: 'Map data &copy; <a href="https://www.openstreetmap.org/">OpenStreetMap</a> contributors',
       maxZoom: 18,
       tileSize: 512,
-      zoomOffset: -1,
-    }).addTo(this.map);
-    L.marker([this.lat, this.long]).addTo(this.map)
-  }
-}
-</script>
-<style scoped>
+      zoomOffset: +1
 #mapId {
   height: 350px;
