[Survived] StringLiteral
vuejs/src/router/index.js:14:11
   },
   {
     path: '/city/create',
-    name: 'CreateCity',
+    name: "",
     component: CreateCity
   },

[Survived] BooleanLiteral
vuejs/src/router/index.js:20:12
   {
     path: '/:cityName',
     name: 'City',
-    props: true,
+    props: false,
     component: City
   }
