[Killed] ObjectLiteral
vuejs/src/store/index.js:4:10
 import { createStore } from 'vuex'
 
 export default createStore({
-  state: {
-    latLongMap: {
-      GRENOBLE: [45.183916, 5.703630],
-      SINGAPOUR: [1.295600, 103.858995],
-      BORDEAUX: [44.848089, -0.571017],
-      BREST: [48.389397, -4.499237],
-      MONTREAL: [45.523000, -73.581700],
-      LYON: [45.767443, 4.858798],
-      RENNES: [48.113409, -1.661249],
-      NANTES: [47.207408, -1.556187],
-      LILLE: [50.648670, 3.075520],
-      PARIS: [48.878932, 2.328487]
-    }
-  },
+  state: {},
   getters: {
     getMapPosition: state => state.latLongMap,

[Killed] UnaryOperator
vuejs/src/store/index.js:8:29
     latLongMap: {
       GRENOBLE: [45.183916, 5.703630],
       SINGAPOUR: [1.295600, 103.858995],
-      BORDEAUX: [44.848089, -0.571017],
+      BORDEAUX: [44.848089, +0.571017],
       BREST: [48.389397, -4.499237],
       MONTREAL: [45.523000, -73.581700],

[Killed] ArrayDeclaration
vuejs/src/store/index.js:8:17
     latLongMap: {
       GRENOBLE: [45.183916, 5.703630],
       SINGAPOUR: [1.295600, 103.858995],
-      BORDEAUX: [44.848089, -0.571017],
+      BORDEAUX: [],
       BREST: [48.389397, -4.499237],
       MONTREAL: [45.523000, -73.581700],

[Killed] UnaryOperator
vuejs/src/store/index.js:9:26
       GRENOBLE: [45.183916, 5.703630],
       SINGAPOUR: [1.295600, 103.858995],
       BORDEAUX: [44.848089, -0.571017],
-      BREST: [48.389397, -4.499237],
+      BREST: [48.389397, +4.499237],
       MONTREAL: [45.523000, -73.581700],
       LYON: [45.767443, 4.858798],

[Killed] UnaryOperator
vuejs/src/store/index.js:10:29
       SINGAPOUR: [1.295600, 103.858995],
       BORDEAUX: [44.848089, -0.571017],
       BREST: [48.389397, -4.499237],
-      MONTREAL: [45.523000, -73.581700],
+      MONTREAL: [45.523000, +73.581700],
       LYON: [45.767443, 4.858798],
       RENNES: [48.113409, -1.661249],

[Killed] UnaryOperator
vuejs/src/store/index.js:12:27
       BREST: [48.389397, -4.499237],
       MONTREAL: [45.523000, -73.581700],
       LYON: [45.767443, 4.858798],
-      RENNES: [48.113409, -1.661249],
+      RENNES: [48.113409, +1.661249],
       NANTES: [47.207408, -1.556187],
       LILLE: [50.648670, 3.075520],

[Killed] UnaryOperator
vuejs/src/store/index.js:13:27
       MONTREAL: [45.523000, -73.581700],
       LYON: [45.767443, 4.858798],
       RENNES: [48.113409, -1.661249],
-      NANTES: [47.207408, -1.556187],
+      NANTES: [47.207408, +1.556187],
       LILLE: [50.648670, 3.075520],
       PARIS: [48.878932, 2.328487]

[Killed] ArrayDeclaration
vuejs/src/store/index.js:13:15
       MONTREAL: [45.523000, -73.581700],
       LYON: [45.767443, 4.858798],
       RENNES: [48.113409, -1.661249],
-      NANTES: [47.207408, -1.556187],
+      NANTES: [],
       LILLE: [50.648670, 3.075520],
       PARIS: [48.878932, 2.328487]

[Killed] ArrayDeclaration
vuejs/src/store/index.js:15:14
       RENNES: [48.113409, -1.661249],
       NANTES: [47.207408, -1.556187],
       LILLE: [50.648670, 3.075520],
-      PARIS: [48.878932, 2.328487]
+      PARIS: []
     }
   },

[Killed] ArrowFunction
vuejs/src/store/index.js:19:21
     }
   },
   getters: {
-    getMapPosition: state => state.latLongMap,
+    getMapPosition: () => undefined,
     getCityPosition: (state, getters) => cityName => getters.getMapPosition[cityName],
     getCities: state => Object.keys(state.latLongMap),

[Killed] ArrowFunction
vuejs/src/store/index.js:20:22
   },
   getters: {
     getMapPosition: state => state.latLongMap,
-    getCityPosition: (state, getters) => cityName => getters.getMapPosition[cityName],
+    getCityPosition: () => undefined,
     getCities: state => Object.keys(state.latLongMap),
   },

[Killed] ArrowFunction
vuejs/src/store/index.js:20:42
   },
   getters: {
     getMapPosition: state => state.latLongMap,
-    getCityPosition: (state, getters) => cityName => getters.getMapPosition[cityName],
+    getCityPosition: (state, getters) => () => undefined,
     getCities: state => Object.keys(state.latLongMap),
   },

[Killed] ArrowFunction
vuejs/src/store/index.js:21:16
   getters: {
     getMapPosition: state => state.latLongMap,
     getCityPosition: (state, getters) => cityName => getters.getMapPosition[cityName],
-    getCities: state => Object.keys(state.latLongMap),
+    getCities: () => undefined,
   },
   mutations: {

[Killed] BlockStatement
vuejs/src/store/index.js:24:29
     getCities: state => Object.keys(state.latLongMap),
   },
   mutations: {
-    createCity(state, city) {
-      state.latLongMap[city.name] = [city.latitude, city.longitude]
-    }
+    createCity(state, city) {}
   },
   actions: {

[Killed] ArrayDeclaration
vuejs/src/store/index.js:25:37
   },
   mutations: {
     createCity(state, city) {
-      state.latLongMap[city.name] = [city.latitude, city.longitude]
+      state.latLongMap[city.name] = []
     }
   },

[Killed] ObjectLiteral
vuejs/src/store/index.js:28:12
       state.latLongMap[city.name] = [city.latitude, city.longitude]
     }
   },
-  actions: {
-    createCity(context, city) {
-      context.commit('createCity', city)
-    }
-  },
+  actions: {},
   modules: {
   }

[Killed] BlockStatement
vuejs/src/store/index.js:29:31
     }
   },
   actions: {
-    createCity(context, city) {
-      context.commit('createCity', city)
-    }
+    createCity(context, city) {}
   },
   modules: {
