[Killed] BlockStatement
vuejs/src/utils/converter.js:1:53
-export function inFahrenheit (temperatureInCelsius) {
-  return temperatureInCelsius * (9 / 5) + 32
-}
+export function inFahrenheit (temperatureInCelsius) {}
 

[Killed] ArithmeticOperator
vuejs/src/utils/converter.js:2:34
 export function inFahrenheit (temperatureInCelsius) {
-  return temperatureInCelsius * (9 / 5) + 32
+  return temperatureInCelsius * (9 * 5) + 32
 }
 

[Killed] ArithmeticOperator
vuejs/src/utils/converter.js:2:10
 export function inFahrenheit (temperatureInCelsius) {
-  return temperatureInCelsius * (9 / 5) + 32
+  return temperatureInCelsius * (9 / 5) - 32
 }
 
