[Killed] StringLiteral
vuejs/src/views/City.vue:113:58
       return format(setMinutes(add(new Date(), {hours: time + 1 - 3}), 0), 'dd/MM/yyyy HH:mm')
     },
     displayDate(date) {
-      return format(parse(date, 'yyyyMMdd', new Date()), 'dd/MM/yyyy')
+      return format(parse(date, 'yyyyMMdd', new Date()), "")
     }
   },

[Killed] StringLiteral
vuejs/src/views/City.vue:113:33
       return format(setMinutes(add(new Date(), {hours: time + 1 - 3}), 0), 'dd/MM/yyyy HH:mm')
     },
     displayDate(date) {
-      return format(parse(date, 'yyyyMMdd', new Date()), 'dd/MM/yyyy')
+      return format(parse(date, "", new Date()), 'dd/MM/yyyy')
     }
   },
