[Killed] BlockStatement
vuejs/src/views/Home.vue:15:15
 <script>
 export default {
   computed: {
-    cities () {
-      return this.$store.getters.getCities
-    }
-  }
-}
-</script>
-
+    cities () {}
