[Killed] BlockStatement
vuejs/src/utils/converter.js:1:46
-export function toFahrenheit (degreeCelsius) {
-  return degreeCelsius * (9 / 5) + 32
-}
+export function toFahrenheit (degreeCelsius) {}
 

[Killed] ArithmeticOperator
vuejs/src/utils/converter.js:2:10
 export function toFahrenheit (degreeCelsius) {
-  return degreeCelsius * (9 / 5) + 32
+  return degreeCelsius / (9 / 5) + 32
 }
 

[Killed] ArithmeticOperator
vuejs/src/utils/converter.js:2:27
 export function toFahrenheit (degreeCelsius) {
-  return degreeCelsius * (9 / 5) + 32
+  return degreeCelsius * (9 * 5) + 32
 }
 
